app/Controllers/Admin/ProjectController.php

SELECT `projects`.*, CONCAT(customers.first_name, " ", customers.last_name) AS customer_name, CONCAT(customers.address1, " ", `customers`.`address2`, " ", customers.city_state) AS customer_address, `customers`.`zipcode`, `customers`.`phone` AS `contact_info`, `customers`.`created_at` AS `customer_created_at`, `users`.`first_name` AS `assigned_to_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
LEFT JOIN `users` ON `users`.`id` = `projects`.`assigned_to`
ORDER BY `projects`.`created_at` DESC
---
    public function index()
    {
        $data['projects'] = $this->projectModel
            ->select('
            projects.*,
            CONCAT(customers.first_name, " ", customers.last_name) AS customer_name,
            CONCAT(customers.address1, " ", customers.address2, " ", customers.city_state) AS customer_address,
            customers.zipcode,
            customers.phone AS contact_info,
            customers.created_at AS customer_created_at,
            users.first_name AS assigned_to_name
        ')
            ->join('customers', 'customers.id = projects.customer_id')
            ->join('users', 'users.id = projects.assigned_to', 'left')
            ->orderBy('projects.created_at', 'DESC')
            ->findAll();