app/Controllers/Admin/ProjectController.php

    public function index()
    {
        $projectModel = new \App\Models\ProjectModel();
        $signModel = new \App\Models\SignModel();
        $userModel = new \App\Models\UserModel();

        // Get all projects
        $data['projects'] = $projectModel->projects();

        // Get the current logged-in user's ID and role
        $userId = session()->get('user_id');
        $data['user_id'] = $userId;  // Ensure we are passing user_id to the view

        $user = $userModel->find($userId);  // Get the logged-in user from the database
        $data['role'] = $user['role'];  // Get the user's role

        // Fetch all signs and group them by project_id
        $signs = $signModel->findAll();
        $signsByProject = [];

        foreach ($signs as $sign) {
            $projectId = $sign['project_id'];

            // Fetch assigned user's name based on 'assigned_to' field in sign table
            $assignedUser = $userModel->find($sign['assigned_to']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '11'
SELECT *
FROM `signs`

    public function view($id)
    {
        // Use the getProjectById method to fetch the project by ID
        $project = $this->projectModel->getProjectById($id);

        // Check if a project was found
        if (!$project) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Project not found.");
        }
        // Fetch the current user's role (example using session)
        $role = session()->get('role');  // Assuming 'role' is stored in the session


        // Fetch related signs for the project
        $signs = (new SignModel())
            ->where('project_id', $id)
            ->findAll();
---
SELECT *
FROM `signs`
WHERE `project_id` = '13'

    public function create()
    {
        $projectModel = new ProjectModel();
        $userModel = new UserModel();

        $data['projects'] = $projectModel->projects(); // this fetches project + customer info
        $data['surveyors'] = $userModel
            ->whereIn('role', ['salessurveyor', 'Surveyor Lite'])
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` IN ('salessurveyor','Surveyor Lite')