app/Views/admin/projects/index.php

                        <ul>
                            <?php
                            $db = \Config\Database::connect();
                            $signs = $db->table('signs')->where('project_id', $project['id'])->get()->getResultArray();
---
SELECT *
FROM `signs`
WHERE `project_id` = '11'