app/Helpers/permission_helper.php

SELECT *
FROM `roles`
WHERE LOWER(name) = 'salessurveyor'
 LIMIT 1
---
    function has_permission(string $permissionName): bool
    {
        $session = session();
        $roleName = strtolower($session->get('role') ?? '');

        // echo "Checking permission: " . $permissionName . " for role: " . $roleName;
        // exit;

        if (!$roleName) {
            return false; // no role in session
        }

        // Admin has all permissions
        if ($roleName === 'admin') {
            return true;
        }



        $roleModel = new RoleModel();
        $rolePermissionModel = new RolePermissionModel();

        // // Get current role
        $role = $roleModel->where('LOWER(name)', $roleName)->first();