app/Controllers/AdminController.php

    public function manageCustomers()
    {
        $model = new CustomerModel();
        $data['customers'] = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `customers`
ORDER BY `created_at` DESC

    public function storeCustomer()
    {
        $model = new CustomerModel();

        $model->save([
            'company_name' => $this->request->getPost('company_name'),
            'first_name'   => $this->request->getPost('first_name'),
            'last_name'    => $this->request->getPost('last_name'),
            'email'        => $this->request->getPost('email'),
            'phone'        => $this->request->getPost('phone'),
            'address1'     => $this->request->getPost('address1'),
            'address2'     => $this->request->getPost('address2'),
            'zipcode'      => $this->request->getPost('zipcode'),
            'city_state'   => $this->request->getPost('city'),
            'created_by'   => session()->get('user_id'), // assuming admin ID is stored in session
        ]);
---
SELECT *
FROM `customers`
WHERE `created_by` = '15'