app/Controllers/ApiController.php

SELECT *
FROM `users`
WHERE `email` = 'balaji@gmail.com'
AND `status` = 'Active'
 LIMIT 1
---
    public function login()
    {
        $data = $this->request->getJSON(true);

        $email = $data['email'] ?? null;
        $password = $data['password'] ?? null;

        if (!$email || !$password) {
            return $this->response->setJSON([
                'error' => 'Email and password are required.'
            ])->setStatusCode(400);
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->where('status', 'Active')->first();