app/Controllers/AuthController.php

    public function doLogin()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)
            ->where('status', 'Active')
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'srinu@gmail.com'
AND `status` = 'Active'
 LIMIT 1