app/Controllers/CustomerController.php

    public function show($id)
    {
        $session = session();
        $user_role = $session->get('role');

        $customerModel = new CustomerModel();
        $projectModel = new ProjectModel();
        $signModel = new SignModel();

        $customer = $customerModel->find($id);
        if (!$customer) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Customer not found.");
        }

        // Get related project IDs
        $projects = $projectModel->where('customer_id', $id)->findAll();
        $projectIds = array_column($projects, 'id');

        // Count signs/tasks
        $signCount = 0;
        if (!empty($projectIds)) {
            $signCount = $signModel->whereIn('project_id', $projectIds)->countAllResults();
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = '1'
SELECT *
FROM `projects`
WHERE `customer_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `signs`
WHERE `project_id` IN ('11')