app/Controllers/RoleController.php

SELECT *
FROM `roles`
---
    public function index()
    {
        $roleModel = new \App\Models\RoleModel();
        $rolePermissionModel = new \App\Models\RolePermissionModel();

        $roles = $roleModel->findAll();

SELECT *
FROM `roles`
WHERE `roles`.`id` = '2'
SELECT *
FROM `permissions`
SELECT *
FROM `role_permission`
WHERE `role_id` = '2'
---
    public function edit($id)
    {
        $roleModel = new RoleModel();
        $permissionModel = new PermissionModel();
        $rolePermissionModel = new RolePermissionModel();

        // Get the role info
        $data['role'] = $roleModel->find($id);

        // Get all permissions
        $data['permissions'] = $permissionModel->findAll();

        // Get permission IDs assigned to this role
        $rolePerms = $rolePermissionModel->where('role_id', $id)->findAll();

DELETE FROM `role_permission`
WHERE `role_id` = '3'
INSERT INTO `role_permission` (`role_id`, `permission_id`) VALUES ('3', '1')
---
    public function update($id)
    {
        $roleModel = new RoleModel();
        $rolePermissionModel = new RolePermissionModel();

        $validation = \Config\Services::validation();

        $roleName = $this->request->getPost('role_name');
        $permissions = $this->request->getPost('permissions') ?? [];

        // Validate role name (if editable)
        $validation->setRules([
            'role_name' => 'required|min_length[3]|max_length[50]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            // Validation failed, redirect back with errors and old input
            return redirect()->back()->withInput()->with('error', implode('<br>', $validation->getErrors()));
        }

        // Update role name (if input present)
        if ($roleName) {
            $roleModel->update($id, ['name' => $roleName]);
        }

        // Update permissions
        $rolePermissionModel->where('role_id', $id)->delete();
        foreach ($permissions as $permId) {
            $rolePermissionModel->insert([
                'role_id' => $id,
                'permission_id' => $permId
            ]);