app/Controllers/SignController.php

    public function index()
    {
        $currentAdminId = session()->get('user_id'); // Get the currently logged-in admin's ID

        // Fetch all signs with related customer, project, and assigned user details
        $signs = $this->signModel
            ->select('
            signs.*,
            customers.company_name AS customer_name,
            projects.name AS project_name,
            assigned_user.first_name AS assigned_first_name,
            assigned_user.last_name AS assigned_last_name
        ')
            ->join('customers', 'customers.id = signs.customer_id', 'left')
            ->join('projects', 'projects.id = signs.project_id', 'left')
            ->join('users as assigned_user', 'assigned_user.id = signs.assigned_to', 'left')
            ->orderBy('signs.created_at', 'DESC')
            ->findAll();

        // Fetch users who can be assigned to a sign: sales_surveyor, surveyor_lite, and the current admin
        $users = $this->UserModel
            ->select('id, first_name, last_name, role')
            ->groupStart()
            ->whereIn('role', ['Sales Surveyor', 'Surveyor Lite'])
            ->orWhere('id', $currentAdminId)
            ->groupEnd()
            ->findAll();
---
SELECT `signs`.*, `customers`.`company_name` AS `customer_name`, `projects`.`name` AS `project_name`, `assigned_user`.`first_name` AS `assigned_first_name`, `assigned_user`.`last_name` AS `assigned_last_name`
FROM `signs`
LEFT JOIN `customers` ON `customers`.`id` = `signs`.`customer_id`
LEFT JOIN `projects` ON `projects`.`id` = `signs`.`project_id`
LEFT JOIN `users` as `assigned_user` ON `assigned_user`.`id` = `signs`.`assigned_to`
ORDER BY `signs`.`created_at` DESC
SELECT `id`, `first_name`, `last_name`, `role`
FROM `users`
WHERE   (
`role` IN ('Sales Surveyor','Surveyor Lite')
OR `id` = '11'
 )

    public function edit($id)
    {
        $signModel = new SignModel();
        $userModel = new UserModel();

        $sign = $signModel->find($id); // returns array by default

        if (!$sign) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Sign not found');
        }

        $users = $userModel->findAll(); // or filter as needed
---
SELECT *
FROM `signs`
WHERE `signs`.`id` = '4'
SELECT *
FROM `users`