app/Controllers/SignController.php

    public function edit($id)
    {
        $signModel = new SignModel();
        $userModel = new UserModel();

        $sign = $signModel->find($id);

        if (!$sign) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Sign not found');
        }

        $currentAdminId = (int) session()->get('user_id');

        // Get only team members with specific roles created by this admin, including self
        $users = $userModel->where('created_by', $currentAdminId)
            ->whereIn('role', ['salessurveyor', 'surveyorlite'])
            ->orWhere('id', $currentAdminId) // include self
            ->findAll();
---
SELECT *
FROM `signs`
WHERE `signs`.`id` = '29'
SELECT *
FROM `users`
WHERE `created_by` = 11
AND `role` IN ('salessurveyor','surveyorlite')
OR `id` = 11