app/Controllers/SuperAdminController.php

SELECT *
FROM `users`
WHERE `role` = 'Admin'
SELECT *
FROM `users`
---
    public function dashboard()
    {
        $model = new \App\Models\UserModel();

        // Fetch all users with role 'Admin'
        $admins = $model->where('role', 'Admin')->findAll();
        $data['admins'] = $model->findAll();