app/Models/CustomerModel.php

SELECT *
FROM `customers`
WHERE `created_by` = 9
ORDER BY `id` DESC
---
    public function getCustomersByAdmin(int $adminId): array
    {
        return $this->where('created_by', $adminId)
            ->orderBy('id', 'DESC')
            ->findAll();