app/Models/ProjectModel.php

SELECT `projects`.*, `customers`.`company_name`, `customers`.`first_name`, `customers`.`last_name`, `customers`.`address1`, `customers`.`address2`, `customers`.`city_state`, `customers`.`zipcode`, `customers`.`email`, `customers`.`phone`, `customers`.`created_at` AS `customer_created_at`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
WHERE `projects`.`id` = '11'
---
    public function getProjectById($id)
    {
        return $this->db->table('projects')
            ->select('
                projects.*,
                customers.company_name,
                customers.first_name,
                customers.last_name,
                customers.address1,
                customers.address2,
                customers.state,
                customers.city,
                customers.zipcode,
                customers.email,
                customers.phone,
                customers.created_at AS customer_created_at
            ')
            ->join('customers', 'customers.id = projects.customer_id')
            ->where('projects.id', $id)
            ->get()
            ->getFirstRow('array'); // Specify return type

SELECT `projects`.*, CONCAT(customers.first_name, " ", customers.last_name) AS customer_name, CONCAT(customers.address1, ", ", `customers`.`address2`, ", ", customers.city_state) AS customer_address, `customers`.`zipcode`, `customers`.`phone` AS `contact_info`, `customers`.`created_at` AS `customer_created_at`, `users`.`first_name` AS `assigned_to_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
LEFT JOIN `users` ON `users`.`id` = `projects`.`assigned_to`
ORDER BY `projects`.`created_at` DESC
---
    public function projects()
    {
        return $this->db->table('projects')
            ->select('
                projects.*,
                CONCAT(customers.first_name, " ", customers.last_name) AS customer_name,
                CONCAT(customers.address1, ", ", customers.address2, ", ", customers.state, ", ", customers.city) AS customer_address,
                customers.zipcode,
                customers.company_name,
                customers.phone AS contact_info,
                customers.created_at AS customer_created_at,
                users.first_name AS assigned_to_name
            ')
            ->join('customers', 'customers.id = projects.customer_id')
            ->join('users', 'users.id = projects.assigned_to', 'left')
            ->orderBy('projects.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT `projects`.*, CONCAT(customers.first_name, " ", customers.last_name) AS customer_name, CONCAT(customers.address1, ", ", `customers`.`address2`, ", ", customers.city_state) AS customer_address, `customers`.`zipcode`, `customers`.`company_name`, `customers`.`phone` AS `contact_info`, `customers`.`created_at` AS `customer_created_at`, `users`.`first_name` AS `assigned_to_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
LEFT JOIN `users` ON `users`.`id` = `projects`.`assigned_to`
WHERE `projects`.`created_by` = '15'
ORDER BY `projects`.`created_at` DESC
---
    public function getProjectsByAdmin($adminId)
    {
        return $this->db->table('projects')
            ->select('
                projects.*,
                CONCAT(customers.first_name, " ", customers.last_name) AS customer_name,
                CONCAT(customers.address1, ", ", customers.address2, ", ", customers.state, ", ", customers.city) AS customer_address,
                customers.zipcode,
                customers.company_name,
                customers.phone AS contact_info,
                customers.created_at AS customer_created_at,
                users.first_name AS assigned_to_name
            ')
            ->join('customers', 'customers.id = projects.customer_id')
            ->join('users', 'users.id = projects.assigned_to', 'left')
            ->where('projects.created_by', $adminId)
            ->orderBy('projects.created_at', 'DESC')
            ->get()
            ->getResultArray();