app/Models/RoleModel.php

SELECT `r`.`id`, `r`.`name`, `r`.`label`, GROUP_CONCAT(p.name SEPARATOR ", ") as permissions
FROM `roles` `r`
LEFT JOIN `role_permission` `rp` ON `rp`.`role_id` = `r`.`id`
LEFT JOIN `permissions` `p` ON `p`.`id` = `rp`.`permission_id`
WHERE `r`.`created_by` = 11
GROUP BY `r`.`id`
ORDER BY `r`.`id` ASC
---
    public function getRolesByAdmin(int $adminId): array
    {
        return $this->db->table('roles r')
            ->select('r.id, r.name, r.label, GROUP_CONCAT(p.name SEPARATOR ", ") as permissions')
            ->join('role_permission rp', 'rp.role_id = r.id', 'left')
            ->join('permissions p', 'p.id = rp.permission_id', 'left')
            ->where('r.created_by', $adminId)
            ->groupBy('r.id')
            ->orderBy('r.id', 'ASC')
            ->get()
            ->getResultArray();