app/Models/RolePermissionModel.php

SELECT `p`.*
FROM `permissions` `p`
JOIN `role_permission` `rp` ON `rp`.`permission_id` = `p`.`id`
WHERE `rp`.`role_id` = '3'
---
    public function getPermissionsByRoleId($roleId)
    {
        return $this->db->table('permissions p')
            ->select('p.*')
            ->join('role_permission rp', 'rp.permission_id = p.id')
            ->where('rp.role_id', $roleId)
            ->get()
            ->getResultArray();