app/Models/SignModel.php

SELECT COUNT(*) AS `numrows`
FROM `signs`
LEFT JOIN `customers` ON `customers`.`id` = `signs`.`customer_id`
LEFT JOIN `projects` ON `projects`.`id` = `signs`.`project_id`
LEFT JOIN `users` as `assigned_user` ON `assigned_user`.`id` = `signs`.`assigned_to`
WHERE `signs`.`created_by` = 11
SELECT `signs`.*, CONCAT(customers.first_name, " ", customers.last_name) AS customer_name, `customers`.`company_name` AS `company_name`, `projects`.`name` AS `project_name`, `assigned_user`.`first_name` AS `assigned_first_name`, `assigned_user`.`last_name` AS `assigned_last_name`
FROM `signs`
LEFT JOIN `customers` ON `customers`.`id` = `signs`.`customer_id`
LEFT JOIN `projects` ON `projects`.`id` = `signs`.`project_id`
LEFT JOIN `users` as `assigned_user` ON `assigned_user`.`id` = `signs`.`assigned_to`
WHERE `signs`.`created_by` = 11
ORDER BY `signs`.`created_at` DESC
 LIMIT 5, 5
---
    public function getSignsByAdminPaginated(int $adminId, int $perPage = 5)
    {
        return $this->select('
            signs.*,
            CONCAT(customers.first_name, " ", customers.last_name) AS customer_name,
            customers.company_name AS company_name,
            projects.name AS project_name,
            assigned_user.first_name AS assigned_first_name,
            assigned_user.last_name AS assigned_last_name
        ')
            ->join('customers', 'customers.id = signs.customer_id', 'left')
            ->join('projects', 'projects.id = signs.project_id', 'left')
            ->join('users as assigned_user', 'assigned_user.id = signs.assigned_to', 'left')
            ->where('signs.created_by', $adminId)
            ->orderBy('signs.created_at', 'DESC')
            ->paginate($perPage);