app/Models/UserModel.php

    public function getTeamMembersByAdmin(int $adminId): array
    {
        return $this->db->table('users')
            ->select('*')
            ->whereIn('role', ['salessurveyor', 'Surveyor Lite'])
            ->where('created_by', $adminId)
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `role` IN ('salessurveyor','Surveyor Lite')
AND `created_by` = 9
ORDER BY `created_at` DESC